Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
bda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6210483156158579563" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180859624000" -> "1758084328347949000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object 00478f05) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2318618513384450973" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1756370466035504200"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8566262409072503981" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292518605725000" -> "1758084329324675000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object 760a0767) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "9174944812984825044" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1756370464464796000"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/6d337b72da46544f3eba4b5da7f3eda1ee4c663e671765c87b43b25da3dd9bd2.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-17T03:53:04.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/6d337b72da46544f3eba4b5da7f3eda1ee4c663e671765c87b43b25da3dd9bd2.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6d337b72da46544f3eba4b5da7f3eda1ee4c663e671765c87b43b25da3dd9bd2.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "785742661646968157" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/6d337b72da46544f3eba4b5da7f3eda1ee4c663e671765c87b43b25da3dd9bd2.zip"
          ~ "timestamp" = "1751598180850831000" -> "1758084329665100000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object b6f1d7bb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5886363415528298593" -> null
      - triggers = {
          - "filename"  = "builds/3deb9cfb06a3801ad79f7f71a1584d85a319237e54853fc25a6dbffff32bfb89.zip"
          - "timestamp" = "1756370465843539000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "791397781466613252" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292517936575800" -> "1758084329451039000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object fa8e2679) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2429529053573960328" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1756370465424006000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4937319150152347549" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1734495186214723200" -> "1758084329668508000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object b8ecb254) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "500578374102782213" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1756370464665024000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9196823578948816802" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598179837004800" -> "1758084328827020000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object f1edb5ad) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8431426310868789310" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1756370465932688000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1006046007951193271" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180671036000" -> "1758084329079914000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object bfa68f3a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4115589044131614105" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1756370464779119000"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1255884654646676292" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1737448472789048000" -> "1758084329678245000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object ceb99e0b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7547751057736799444" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1756370465181976000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "837775832900453847" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292517221816000" -> "1758084329231970000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 78ee536f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3381875764896577497" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1756370464960100800"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5122441992897323621" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739950386465660000" -> "1758084329228151000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object 0a77bcbb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6457215922927900358" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1756370465052303000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8098832515767239528" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180250890000" -> "1758084328968929000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object b0bff1a5) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7049826718450211672" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1756370465487206000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "766383955238855230" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748396983081240800" -> "1758084328470196000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object a31cdb2c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2314089214444203724" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1756370465324335000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:59",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2788805440736578596" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742181576398202000" -> "1758084328856982000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object e45c96a9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1866980664462750726" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1756370465531510200"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3952398058185948308" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742181577061003000" -> "1758084328347152000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 7af8d59d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8025891976175474810" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1756370465974124000"
        } -> null
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:55e194aa6ffc19fe95d7dbafbb4b55f36fd870662d67b37e5caf50adaa360a0b" -> (known after apply)
      ~ last_modified                  = "2025-08-28T08:44:05.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:59",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1195631066091557362" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080898092570000" -> "1758084329178566000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63" -> (known after apply)
      ~ code_sha256                 = "d5SZI/SOLAWL4XahEEXGxdY3gAU0J+tX0/wuz1AlGZo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T03:51:55.206+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:63" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/eb041400bf313ba9d743b10201ec72d82c18ddecd7ade9b5cf939df2c1fb7a3a.zip" -> "builds/95e81208162a46c3387225492c96449fcc4cae07d5d6dd7d58e4cf3f727a09db.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23833972 -> (known after apply)
      ~ version                     = "63" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object 45211fcd) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:62" -> null
      - code_sha256                 = "ZcsgXBWac5oycc6sImUjmeQChJFNgWiw/tIxxHsISvI=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T08:44:26.483+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:62" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gaspi-lambda-layers-20250725041417117200000004" -> null
      - s3_key                      = "builds/ab9445dc83237aa5a81cf41e02df2cf42829ed447c476491235807cca8e8cb61.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24398911 -> null
      - version                     = "62" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/eb041400bf313ba9d743b10201ec72d82c18ddecd7ade9b5cf939df2c1fb7a3a.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "da4607b0b460d88c6e446f9f415d4cf8-5" -> (known after apply)
      ~ id                            = "builds/eb041400bf313ba9d743b10201ec72d82c18ddecd7ade9b5cf939df2c1fb7a3a.zip" -> (known after apply)
      ~ key                           = "builds/eb041400bf313ba9d743b10201ec72d82c18ddecd7ade9b5cf939df2c1fb7a3a.zip" -> "builds/95e81208162a46c3387225492c96449fcc4cae07d5d6dd7d58e4cf3f727a09db.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/eb041400bf313ba9d743b10201ec72d82c18ddecd7ade9b5cf939df2c1fb7a3a.zip" -> "builds/95e81208162a46c3387225492c96449fcc4cae07d5d6dd7d58e4cf3f727a09db.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object b8cf1741) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/ab9445dc83237aa5a81cf41e02df2cf42829ed447c476491235807cca8e8cb61.zip" -> null
      - bucket                        = "gaspi-lambda-layers-20250725041417117200000004" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "a3cdc476d542a46988486cd79ce634a4-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/ab9445dc83237aa5a81cf41e02df2cf42829ed447c476491235807cca8e8cb61.zip" -> null
      - key                           = "builds/ab9445dc83237aa5a81cf41e02df2cf42829ed447c476491235807cca8e8cb61.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/ab9445dc83237aa5a81cf41e02df2cf42829ed447c476491235807cca8e8cb61.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "dev"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/95e81208162a46c3387225492c96449fcc4cae07d5d6dd7d58e4cf3f727a09db.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/95e81208162a46c3387225492c96449fcc4cae07d5d6dd7d58e4cf3f727a09db.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7014505684496778554" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/eb041400bf313ba9d743b10201ec72d82c18ddecd7ade9b5cf939df2c1fb7a3a.zip" -> "builds/95e81208162a46c3387225492c96449fcc4cae07d5d6dd7d58e4cf3f727a09db.zip"
          ~ "timestamp" = "1753324714694181000" -> "1758084344563966000"
        }
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 4c2e2cd9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1375233611701168896" -> null
      - triggers = {
          - "filename"  = "builds/ab9445dc83237aa5a81cf41e02df2cf42829ed447c476491235807cca8e8cb61.zip"
          - "timestamp" = "1756370477074039000"
        } -> null
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31" -> (known after apply)
      ~ code_sha256                 = "qe0BD1dsTOS5RWWGusw9C1jZzODJMyIGmm+rvoXYONM=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-17T03:51:48.958+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:31" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/1efc8330ba569407ab94c9bf8168e4c7dbf9d1688a77998429960a684b8abefc.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 39435 -> (known after apply)
      ~ version                     = "31" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object fe8b33cf) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:30" -> null
      - code_sha256                 = "TnjA0PkUhbExEGDQm8y7ZS+kRuJgnmIRFCAldIryp9E=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T08:44:07.025+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:30" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer" -> null
      - layer_name                  = "sbeacon_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gaspi-lambda-layers-20250725041417117200000004" -> null
      - s3_key                      = "builds/35800df90a132e98ef52892666ae269925cdd321f53f5b9eda8bd0bd4ea5cde8.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 120508 -> null
      - version                     = "30" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "a0ba0189bff09b03d7e41589571d0459" -> (known after apply)
      ~ id                            = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ key                           = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/1efc8330ba569407ab94c9bf8168e4c7dbf9d1688a77998429960a684b8abefc.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/1efc8330ba569407ab94c9bf8168e4c7dbf9d1688a77998429960a684b8abefc.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 80bb713b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/35800df90a132e98ef52892666ae269925cdd321f53f5b9eda8bd0bd4ea5cde8.zip" -> null
      - bucket                        = "gaspi-lambda-layers-20250725041417117200000004" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "b4837b1cde56e19ac1fcf21dc8ac9ca8" -> null
      - force_destroy                 = false -> null
      - id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/35800df90a132e98ef52892666ae269925cdd321f53f5b9eda8bd0bd4ea5cde8.zip" -> null
      - key                           = "builds/35800df90a132e98ef52892666ae269925cdd321f53f5b9eda8bd0bd4ea5cde8.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/35800df90a132e98ef52892666ae269925cdd321f53f5b9eda8bd0bd4ea5cde8.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "dev"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1efc8330ba569407ab94c9bf8168e4c7dbf9d1688a77998429960a684b8abefc.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1efc8330ba569407ab94c9bf8168e4c7dbf9d1688a77998429960a684b8abefc.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "830949945973643714" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/1efc8330ba569407ab94c9bf8168e4c7dbf9d1688a77998429960a684b8abefc.zip"
          ~ "timestamp" = "1758080898094948000" -> "1758084329668137000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] (deposed object b45167a4) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5531253176015173486" -> null
      - triggers = {
          - "filename"  = "builds/35800df90a132e98ef52892666ae269925cdd321f53f5b9eda8bd0bd4ea5cde8.zip"
          - "timestamp" = "1756370464846798000"
        } -> null
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "security-sendSecurityAlert"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "security-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GASPI_ADMIN_EMAIL" = "devops@xapiens.id" -> "brendan.hosking@csiro.au"
              ~ "SES_SOURCE_EMAIL"  = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6309241231763471949" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1746500163130550000" -> "1758084329775961000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:3650099cae6961fc5b9f79d242950e68fec5e2a51a07a423631f83cbb1fee342307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:3650099cae6961fc5b9f79d242950e68fec5e2a51a07a423631f83cbb1fee342" -> (known after apply)
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ repo_digest  = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:1314ef3287fc2810aeb093f9574f07a8c4d65db8efd42ed9afca8f75b3b9979d" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "8e5646c03d164dcff350804855b2cee187a0e93f" -> "45f32ed728d37f95caff9c01b8efbc53506894ba"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:1314ef3287fc2810aeb093f9574f07a8c4d65db8efd42ed9afca8f75b3b9979d" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:1314ef3287fc2810aeb093f9574f07a8c4d65db8efd42ed9afca8f75b3b9979d" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "8e5646c03d164dcff350804855b2cee187a0e93f" -> "45f32ed728d37f95caff9c01b8efbc53506894ba"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:9ffd6a2079c00e5cd13c2b51221eb6b1681d7c61009e0376be112b231240dbe6307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:9ffd6a2079c00e5cd13c2b51221eb6b1681d7c61009e0376be112b231240dbe6" -> (known after apply)
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ repo_digest  = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:0d7695d4ba077bd016406b25c20b632149e83672186f7f7f8490356a2e6798f1" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "80e5730eb112f54f72aa5616d8b20da0a633fc5e" -> "7f867e307605016843de5024d8d908c258e9b34a"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:0d7695d4ba077bd016406b25c20b632149e83672186f7f7f8490356a2e6798f1" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:0d7695d4ba077bd016406b25c20b632149e83672186f7f7f8490356a2e6798f1" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "80e5730eb112f54f72aa5616d8b20da0a633fc5e" -> "7f867e307605016843de5024d8d908c258e9b34a"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3623785385470244293" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753928922753800000" -> "1758084342921024000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4043222748185293086" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753928923061675000" -> "1758084342757561000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (deposed object 30aa19ad) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6444966442973296783" -> null
      - triggers = {
          - "filename"  = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
          - "timestamp" = "1756370468935638000"
        } -> null
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7518094010497950185" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908990909000" -> "1758084343678702200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8243263346371071718" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909079166800" -> "1758084343838679000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8093642150869090189" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909271470000" -> "1758084343262698000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1838297842359627375" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908869195000" -> "1758084343012651000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2832701594851689794" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080909002063000" -> "1758084343091014000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:53",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2763088209303065527" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908447426000" -> "1758084343844062000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/bad3415550ced4a6beaf9659c18f8ea3225f37792fd8d8e61e5e833d4706a45a.zip" -> "builds/f3332ec8b395b03d345409c20b1abe5d4662a9c60468d4640078b65c31b66a3e.zip"
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-09-17T03:52:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f3332ec8b395b03d345409c20b1abe5d4662a9c60468d4640078b65c31b66a3e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f3332ec8b395b03d345409c20b1abe5d4662a9c60468d4640078b65c31b66a3e.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9061037694019347932" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bad3415550ced4a6beaf9659c18f8ea3225f37792fd8d8e61e5e833d4706a45a.zip" -> "builds/f3332ec8b395b03d345409c20b1abe5d4662a9c60468d4640078b65c31b66a3e.zip"
          ~ "timestamp" = "1758080909272576000" -> "1758084343833079000"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_python_modules_layer:58",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "FILTERS"                    = jsonencode(
                  ~ {
                      ~ min_qual         = 10 -> 0
                        # (4 unchanged attributes hidden)
                    }
                )
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6280554306333925258" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080908460342000" -> "1758084343138351000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (deposed object 1efd4fb9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.